Scr/Catalogs/ПечатныеФормы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ПечатныеФормы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>хрОбработкаПечати</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>333</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Лог</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолеГруппировки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>55</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗамещаетОсновнуюФорму</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПроцедурыПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>111</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Подписи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФильтрЗапроса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтрокаФильтра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>222</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗнФильтра</Name>
							<Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФормыПоКонтрагентам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>хрОбработкаПечати</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФайлаОбработки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>333</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Лог</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыДокументов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДокумента</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыДокументовДЛяПечФорм</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Scr/Documents/ро_ПриходОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ро_ПриходОборудования</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстатокРО</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТТНвходящий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>33</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>стрИдентификаторСкладаR3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>77</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Лог</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПунктРазгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПунктыПогрузки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПозиций</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПЛ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПЛ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГосНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВодительФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПеревозчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>333</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефоныПеревозчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СопроводительныеДокументы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>55</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПунктПогрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПунктыПогрузки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Плательщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесТТН</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМестТТН</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписант</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>222</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписантДолжность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>222</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролерСТК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОбработкиДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогПроверил</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Оборудования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Оборудование</Name>
							<Comment>-</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ро_Оборудование</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерОборудования</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>33</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Плательщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокЗаказНаряд</Name>
							<Comment>-</Comment>
							<Type>
								<v8:Type>cfg:DocumentRef.роЗаказНаряд</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСкладаR3</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ро_ИдентификаторСкладаЗаказчика</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОборудованиеПримечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>222</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>масса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнвНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>33</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Scr/Catalogs/ро_ИдентификаторСкладаЗаказчика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ро_ИдентификаторСкладаЗаказчика</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеЗаказчикаНаПечать</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>77</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Scr/Catalogs/ПечатныеФормы/Ext/ManagerModule.bsl
Функция НайтиЭлементСПечФормами(сс) Экспорт
	
	имяСпр = сс.метаданные().имя;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ TOP 1
	               |	КонтрагентыПечатныеФормы.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник."+имяСпр+".ПечатныеФормы КАК КонтрагентыПечатныеФормы
				   |
	               |ГДЕ
	               |	КонтрагентыПечатныеФормы.Ссылка = &Ссылка
				   |
				   |UNION ALL
				   |
				   |ВЫБРАТЬ TOP 1
	               |	КонтрагентыПечатныеФормы.Ссылка КАК Ссылка
	               |ИЗ
	               |	       Справочник."+имяСпр+".ПечатныеФормы КАК КонтрагентыПечатныеФормы
	               |INNER JOIN Справочник."+имяСпр+" КАК ПЕч ON Печ.Родитель  = КонтрагентыПечатныеФормы.Ссылка
				   |
	               |ГДЕ
	               |	ПЕч.Ссылка = &Ссылка
				   |
				   |UNION ALL
				   |
				   |ВЫБРАТЬ TOP 1
	               |	КонтрагентыПечатныеФормы.Ссылка КАК Ссылка
	               |ИЗ
	               |	       Справочник."+имяСпр+".ПечатныеФормы КАК КонтрагентыПечатныеФормы
	               |INNER JOIN Справочник."+имяСпр+" КАК ПЕч1 ON Печ1.Родитель  = КонтрагентыПечатныеФормы.Ссылка
	               |INNER JOIN Справочник."+имяСпр+" КАК ПЕч0 ON Печ0.Родитель  = Печ1.Ссылка
				   |
	               |ГДЕ
	               |	Печ0.Ссылка = &Ссылка
				   | ";
	Запрос.УстановитьПараметр("ссылка",сс);
		
	
	Выб = Запрос.Выполнить().Выбрать();
	Если Выб.Следующий() Тогда
		Возврат Выб.ссылка;
	ИНаче
		Возврат сс;
	КонецЕСЛИ;
	
КонецФункции

//Функция такая
//
//Параметры:
//  ВидДокумента - Перечисление.ВидыДокументовДЛяПечФорм
//  ссКА - Справочник.Контрагенты, по которому включен отбор
Функция НайтиПечФормуПоВиду(ВидДокумента,ссКА) Экспорт
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ TOP 1
	|	КонтрагентыПечатныеФормы.ПечФорма КАК ПечФорма
	|ИЗ
	|	Справочник.Контрагенты.ПечатныеФормы КАК КонтрагентыПечатныеФормы
	|INNER JOIN Справочник.ПечатныеФормы СпрПеч ON СпрПеч.ссылка = КонтрагентыПечатныеФормы.ПечФорма
	|                                          and СпрПеч.ЗамещаетОсновнуюФорму = Истина
	|INNER JOIN Справочник.ПечатныеФормы.ВидыДокументов родПеч ON родПеч.ссылка = спрПеч.Родитель
	|                                                         and родПеч.ВидДокумента = &ВидДокумента
	|ГДЕ
	|	КонтрагентыПечатныеФормы.Ссылка = &Ссылка
	|	 ";
	Запрос.УстановитьПараметр("Ссылка",ссКА);
	Запрос.УстановитьПараметр("ВидДокумента",ВидДокумента);
	Выб = Запрос.Выполнить().Выбрать();
	Если Выб.Следующий() Тогда
		текПечФорма = Выб.Печформа;
	ИНаче
		Возврат Неопределено;
	КонецЕсли;
	
	
	
	ДвоичныеДанные = текПечФорма.хрОбработкаПечати.Получить();
	Поток = ДвоичныеДанные.ОткрытьПотокДляЧтения();
	Макет = Новый ТабличныйДокумент;
	Макет.Прочитать(Поток);
	Поток.Закрыть();
	Возврат Макет;
	
	
	
КонецФункции

Функция НайтиПечФормы(сс,ФильтрКонтрагент,ВидДокумента) Экспорт
	
	имяСпр = сс.метаданные().имя;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ 
	               |	КонтрагентыПечатныеФормы.ПечФорма КАК ПечФорма,
	               |	КонтрагентыПечатныеФормы.ИспользоватьВДокументах КАК ИспользоватьВДокументах
				   |INTO врТбл
	               |ИЗ
	               |	Справочник."+имяСпр+".ПечатныеФормы КАК КонтрагентыПечатныеФормы
				   |
	               |ГДЕ
	               |	КонтрагентыПечатныеФормы.Ссылка = &Ссылка
				   |  и (КонтрагентыПечатныеФормы.Контрагент = &КА или КонтрагентыПечатныеФормы.Контрагент = Значение(Справочник.Контрагенты.ПустаяСсылка) )
				   |
				   |UNION ALL
				   |
				   |ВЫБРАТЬ 
	               |	КонтрагентыПечатныеФормы.ПечФорма КАК ПечФорма,
	               |	КонтрагентыПечатныеФормы.ИспользоватьВДокументах КАК ИспользоватьВДокументах
	               |ИЗ
	               |	       Справочник."+имяСпр+".ПечатныеФормы КАК КонтрагентыПечатныеФормы
	               |INNER JOIN Справочник."+имяСпр+" КАК ПЕч ON Печ.Родитель  = КонтрагентыПечатныеФормы.Ссылка
				   |
	               |ГДЕ
	               |	 Печ.Ссылка = &Ссылка
				   |  и (КонтрагентыПечатныеФормы.Контрагент = &КА или КонтрагентыПечатныеФормы.Контрагент = Значение(Справочник.Контрагенты.ПустаяСсылка) )
				   |
				   |UNION ALL
				   |
				   |ВЫБРАТЬ 
	               |	КонтрагентыПечатныеФормы.ПечФорма КАК ПечФорма,
	               |	КонтрагентыПечатныеФормы.ИспользоватьВДокументах КАК ИспользоватьВДокументах
	               |ИЗ
	               |	       Справочник."+имяСпр+".ПечатныеФормы КАК КонтрагентыПечатныеФормы
	               |INNER JOIN Справочник."+имяСпр+" КАК ПЕч1 ON Печ1.Родитель  = КонтрагентыПечатныеФормы.Ссылка
	               |INNER JOIN Справочник."+имяСпр+" КАК ПЕч0 ON Печ0.Родитель  = Печ1.Ссылка
				   |
	               |ГДЕ
	               |	Печ0.Ссылка = &Ссылка
				   |  и (КонтрагентыПечатныеФормы.Контрагент = &КА или КонтрагентыПечатныеФормы.Контрагент = Значение(Справочник.Контрагенты.ПустаяСсылка) )
				   |;
				   |
				   |SELECT DISTINCT
				   | Спр.Наименование,
				   | Спр.Код,
				   | СпрРОд.ИмяПроцедурыПечати
				   |
				   |FROM Справочник.ПечатныеФормы Спр
				   |INNER JOIN Справочник.ПечатныеФормы СпрРОд ON СпрРОд.ссылка = Спр.Родитель
				   |INNER JOIN Справочник.ПечатныеФормы.ВидыДокументов спрПечВид ON спрПечВид.ссылка = Спр.Родитель
				   |                                                              и спрПечВид.ВидДокумента В (&МасВид)
				   |
				   |INNER JOIN врТбл Тбл ON Тбл.ПечФорма = Спр.Ссылка
				   |
				   |WHERE Спр.ЗамещаетОсновнуюФорму=Ложь
				   | ";
	Запрос.УстановитьПараметр("ссылка",сс);
	Запрос.УстановитьПараметр("КА",ФильтрКонтрагент);
	Запрос.УстановитьПараметр("МасВид",ВидДокумента);
	Возврат Запрос.Выполнить().Выгрузить();	
	
КонецФункции

//ИспользоватьВДокументах 1 - Приход
//						  2 - Расход
//						  3 - Реестр
//						  4 - Испытания

Процедура ДобавитьКнопкиПечати(Форма,элементСпрСС,ВидДокумента,ФильтрКонтрагент=Неопределено) Экспорт
	
		Элементы = Форма.Элементы;
		
		Если  Элементы.Найти("ГруппаПечатныеКоманды")=Неопределено Тогда
			Возврат;
		КонецЕслИ;
		
		тблПеч = НайтиПечФормы(элементСпрСС,ФильтрКонтрагент,ВидДокумента);
		Если тблПеч.Количество()=0 Тогда
			новСтр = тблПеч.Добавить();
			новСТр.Код = "Макет";
			новСТр.Наименование = "Акт";
		КонецЕСли;
		
		тблПеч.КОлонки.Добавить("Ключ");
		ДЛя каждого Стр из тблПеч Цикл
			Стр.ключ = "кнПечФорм"+Стр.Код;
		КонецЦикла;
		
		масУдл = Новый МАссив;
		Для каждого Эл из Элементы.ГруппаПечатныеКоманды.ПодчиненныеЭлементы Цикл
			нс = тблПеч.НАйти(Эл.Имя,"ключ");
			Если нс=Неопределено Тогда
				масУдл.Добавить(Эл);
			ИНАче
				тблПеч.Удалить(нс);
			КонецЕСЛИ;
		КонецЦикла;
		
		Для каждого Эл из МасУдл Цикл
			Элементы.Удалить(Эл);
		КонецЦиклА;
		
		Для каждого стр из тблПеч Цикл
			
			Если Форма.Команды.НАйти(стр.ключ)=Неопределено Тогда
				Кмд = Форма.Команды.Добавить(стр.Ключ);
				Если СокрЛП(Стр.ИмяПроцедурыПечати) = "" Тогда
					Кмд.Действие = "Печать";
				Иначе
					Кмд.Действие = Стр.ИмяПроцедурыПечати;
				КонецЕсли;
				Кмд.Заголовок = стр.Ключ;	
			КонецЕсли;
			
			
			ЭЛ = Элементы.Добавить(стр.Ключ,Тип("КнопкаФормы"),Элементы.ГруппаПечатныеКоманды);
			Эл.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
			Эл.Заголовок = стр.Наименование;
			Эл.ИмяКоманды = стр.Ключ;
			
		КонецЦикла;
		
		Если тблПеч.Количество()>3 Тогда
			 Элементы.ГруппаПечатныеКоманды.Вид = ВидГруппыФормы.Подменю;
			 Элементы.ГруппаПечатныеКоманды.Заголовок = "Печатные формы";
		КонецеслИ;
	
КонецПроцедуры
	
	
Функция ПечатьПоКодуФормы(ссДок,код,КА=неопределено) Экспорт
	
	имяМетаДок = ссДок.Метаданные().Имя;
		
	код = СтрЗаменить(код,"кнПечФорм","");
	Если код = "Макет" Тогда
		Код = "Акт "+ссДок.номер;
		Возврат Документы[имяМетаДок].ПечатьНакладная(ссДок,Неопределено);
	КонецЕСЛИ;
	
	сс = Справочники.ПечатныеФормы.НайтиПоКоду(код);
	Если сс.Пустая() ТОгда
		Сообщить("Не найден код: "+код);
		Возврат Неопределено;
	КонецЕСли;
	
	ссНаименование = сс.Наименование;
	
	Если КА<>Неопределено ТОгда
		нс = Сс.ФормыПоКонтрагентам.Найти(КА,"Контрагент");
		Если нс<>Неопределено Тогда
			сс = нс;
		КонецЕСли;
	КонецЕСлИ;
	
	Если нрег(прав(сс.ИмяФайлаОбработки,4)) = ".mxl" Тогда
		
		ДвоичныеДанные = сс.хрОбработкаПечати.Получить();
		Поток = ДвоичныеДанные.ОткрытьПотокДляЧтения();
		Макет = Новый ТабличныйДокумент;
		Макет.Прочитать(Поток);
		Поток.Закрыть();
	
		Код = ссНаименование+ссДок.номер;
		Возврат Документы[имяМетаДок].ПечатьНакладная(ссДок,Макет,сс);
		
	КонецЕслИ;
	
	
	Сообщить("неопознанный файл "+сс.ИмяФайлаОбработки );
	Возврат НЕопределено;
	
КонецФункции

Процедура ЗаполнитьПодписантов(Стк,сс) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПечатныеФормыПодписи.ФизЛицо.Фамилия КАК ФизЛицоФамилия,
	               |	ПОДСТРОКА(ПечатныеФормыПодписи.ФизЛицо.Имя, 1, 1) КАК ФизЛицоИмя,
	               |	ПОДСТРОКА(ПечатныеФормыПодписи.ФизЛицо.Отчество, 1, 1) КАК ФизЛицоОтчество
	               |ИЗ
	               |	Справочник.ПечатныеФормы.Подписи КАК ПечатныеФормыПодписи
	               |ГДЕ
	               |	ПечатныеФормыПодписи.Ссылка = &Ссылка
	               |	И ПечатныеФормыПодписи.ФизЛицо <> Значение(Справочник.ФизическиеЛица.ПустаяСсылка) ";
	Выб = Запрос.Выполнить().Выбрать();
	
	ном = 0;
	Пока Выб.Следующий() Цикл
		ном=ном+1;
		имя = Выб.ФизЛицоФамилия+" "+Выб.ФизЛицоИмя+"."+Выб.ФизЛицоОтчество+".";
		Стк.вставить("Подписант"+ном,имя);
	КонецЦикла;
	
КонецПроцедуры

#Область Печать

Функция ДанныеДляПечати(ссМас,МасКол,сткШапка,ссПечФормы=Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	роЗаказНаряд.Номер КАК НомерЗаказа0,
	               |	роЗаказНаряд.Дата  КАК ДатаЗаказа0,
	               |	CASE WHEN НомерОборудованияКор="""" THEN роЗаказНаряд.НомерОборудования ELSE НомерОборудованияКор END КАК НомерОборудования0,
	               |	CASE WHEN ИнвНомерКор="""" THEN роЗаказНаряд.ИнвНомер ELSE ИнвНомерКор END КАК ИнвНомер,
	               |	роЗаказНаряд.ОборудованиеПримечание КАК ОборудованиеПримечание,
	               |	роЗаказНаряд.Оборудование.Код КАК ОборудованиеКод,
	               |	роЗаказНаряд.Оборудование.КодR3 КАК КодR3,
	               |	роЗаказНаряд.ИдентификаторСкладаR3 КАК ИдентификаторСкладаR3,
	               |	CASE WHEN роЗаказНаряд.Плательщик = Значение(Справочник.Контрагенты.ПустаяСсылка) 
				   |         THEN ДокОтг.ссылка.Контрагент.НаименованиеДляТТН 
				   |         ELSE роЗаказНаряд.Плательщик.НаименованиеДляТТН 
				   |         END КАК Плательщик,
	               |	роЗаказНаряд.Заключение.ТекстВТТН КАК ТекстВТТН,
	               |	роЗаказНаряд.Масса КАК Масса,
	               |	ДокОтг.ссылка.Контрагент.НаименованиеПолное КАК Контрагент,
				   |    ДокОтг.ссылка.Организация.НаименованиеПолное КАК Организация,
	               |	ДокОтг.ссылка.Контрагент.Адрес КАК АдресКА,
	               |	ДокОтг.ссылка.Подписант КАК каФИО0,
	               |	ДокОтг.ссылка.ПодписантДолжность КАК каДлж,
				   |	ДокОтг.ссылка.Дата КАК ДатаДок,
				   |	ДокОтг.ссылка.Номер КАК Номер,
				   |	ДокОтг.ссылка.Ответственный.Наименование КАК Ответственный,
				   |	ISNULL(ДокПриход.Дата,ДокОтг.ссылка.Дата) КАК ДатаПрх,
				   |	ДокПриход.Номер КАК номерПрх,
				   |	роЗаказНаряд.Оборудование.Наименование КАК ОборудованиеНаименование,
				   |	роЗаказНаряд.Оборудование.ЕдиницаИзмерения КАК ЕдИзм,
				   
				   |    ДокРееШапка.Договор,
				   
				   |    ДокПриход.ссылка   ДокПрх,
				   |    ДокОтгШапка.ссылка ДокОтг,
				   |
				   |	ISNULL(ДокОтгШапка.Дата,ДокОтг.ссылка.Дата) КАК датаОтг,
				   |	ISNULL(ДокОтгШапка.Номер,ДокОтг.ссылка.Номер) КАК номерОтг,
				   |	ДокОтгШапка.ТС КАК ТС,
				   |	ДокОтгШапка.ГосНомер КАК ГосНомер,
				   |	ДокОтгШапка.ВодительФИО КАК ВодительФИО,
				   |	ДокОтг.ссылка.КонтролерСТК.Наименование КАК КонтролерСТК0,
				   |	ДокОтг.ссылка.КонтролерСТК.Должность    КАК длжКонтролерСТК,
				   |    роЗаказНаряд.ссылка ЗаказНарядСсылка,
				   
				   |    0 КоличествоМеталлолом,
				   |    0 Цена,
				   |    0 Сумма,
				   
				   |    1 Количество
	               |ИЗ
				   |   Документ.ро_Отгрузка.ЗаказНаряды ДокОтг
	        	   |INNER JOIN 	Документ.роЗаказНаряд КАК роЗаказНаряд 			ON докОтг.ЗаказНаряд   = роЗаказНаряд.ссылка
				   |LEFT OUTER JOIN Документ.ро_Отгрузка ДокОтгШапка         	ON ДокОтгШапка.ссылка  = роЗаказНаряд.ДокОтгрузки
				   |LEFT OUTER JOIN Документ.ро_ПриходОборудования ДокПриход   	ON ДокПриход.ссылка    = роЗаказНаряд.ДокументПоступление
				   |LEFT OUTER JOIN Справочник.ро_ИдентификаторСкладаЗаказчика СпрИдСкл ON СпрИдСкл.ссылка = роЗаказНаряд.ИдентификаторСкладаR3 и СпрИдСкл.НаименованиеЗаказчикаНаПечать <> """"
				   |LEFT OUTER JOIN Документ.ро_Реестры ДокРееШапка         	ON ДокРееШапка.ссылка  = ДокОтг.ссылка
				   |
	               |ГДЕ
	               |	ДокОтг.Ссылка в (&Ссылка)";
	
	Запрос.УстановитьПараметр("ссылка",ссМас);
	
	Если ТипЗнч(ссМас)=Тип("Массив") Тогда
		пСс = ссМас[0];
	иначе
		пСс = ссМас;
	КонецЕсли;
	
	Если ТипЗнч(пСс) = Тип("ДокументСсылка.ро_ПриходОборудования") ТОгда
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"Документ.ро_Отгрузка.ЗаказНаряды","Документ.ро_ПриходОборудования.Оборудования");
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"Документ.ро_Отгрузка","Документ.ро_ПриходОборудования");
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"докОтг.ЗаказНаряд","докОтг.ДокЗаказНаряд");
	ИНачеЕсли ТипЗнч(пСс) = Тип("ДокументСсылка.ро_Реестры") ТОгда
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"Документ.ро_Отгрузка.ЗаказНаряды","Документ.ро_Реестры.ЗаказНаряды");
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"0 КоличествоМеталлолом,","Металлолом КоличествоМеталлолом,");
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"0 Цена,","ДокОтг.Цена Цена,");
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"0 Сумма,","ДокОтг.Цена Сумма,");
	КонецеСЛИ;
	
	
	Если ссПечФормы<>Неопределено Тогда
		а=0;
		Для каждого стрФлт из ссПечФормы.ФильтрЗапроса Цикл
			а=а+1;
			Запрос.Текст = Запрос.Текст + СтрЗаменить(нрег(стрФлт.СтрокаФильтра),"&зн","&зн"+а);
			Запрос.УстановитьПараметр("зн"+а,стрФлт.ЗнФильтра);
		КонецЦикла;
	КонецЕсли;
	
	Тбл = запрос.Выполнить().Выгрузить();
	ТБл.Колонки.Добавить("НомерОборудования");
	ТБл.Колонки.Добавить("НомерЗаказа");
	
	
	Если МасКол.Найти("номероборудования")<>Неопределено или МасКол.Найти("номерзаказа")<>Неопределено Тогда
		Т = Тбл.Скопировать(,"ОборудованиеНаименование,КодR3,ИдентификаторСкладаR3,Плательщик,ТекстВТТН,ОборудованиеПримечание,инвНомер");
		Т.Свернуть("ОборудованиеНаименование,КодR3,ИдентификаторСкладаR3,Плательщик,ТекстВТТН,ОборудованиеПримечание,инвНомер","");
		Для каждого С из Т Цикл
			Мас = Тбл.НайтиСтроки(Новый Структура("ОборудованиеНаименование,КодR3,ИдентификаторСкладаR3,Плательщик,ТекстВТТН,ОборудованиеПримечание,инвНомер",с.ОборудованиеНаименование,с.КодR3,с.ИдентификаторСкладаR3,с.Плательщик,с.ТекстВТТН,с.ОборудованиеПримечание,с.инвНомер));
			пСтр = "";
			пЗак = "";
			Для каждого Эл из Мас Цикл
				Если СокрЛП(эл.НомерОборудования0)<>"" Тогда
					пСтр = пСтр + ","+СокрЛП(эл.НомерОборудования0);
				КонецеСЛИ;
				Если СокрЛП(эл.НомерЗаказа0)<>"" Тогда
					пЗак = пЗак + ","+СокрЛП(эл.НомерЗаказа0);
				КонецеСЛИ;
			КонецЦикла;
			пСтр = Сред(пСтр,2);
			пЗак = Сред(пЗак,2);
			
			Если СокрЛП(С.ТекстВТТН)<>"" Тогда
				пСтр = ""+С.ТекстВТТН+": "+пСтр;
			КонецЕсли;
			
			Для каждого Эл из Мас Цикл
				Эл.НомерОборудования = пСтр;
				Эл.НомерЗаказа = пЗак;
			КонецЦикла;
			
		КонецЦикла;
	КонецЕсли;
	
	
	Для каждого Стр из Тбл Цикл
		сткШапка.Вставить("Контрагент",Стр.Контрагент);
		сткШапка.Вставить("Организация",Стр.Организация);
		
		сткШапка.вставить("Дата",Формат(Стр.ДатаДок,"ДФ=dd.MM.yyyy"));
		сткШапка.вставить("ДатаМес",Формат(Стр.ДатаДок,"ДФ='dd MMMM yyyy'"));
		
		сткШапка.вставить("КонтролерСТК",СПравочники.ФизическиеЛица.ФИОстр(Стр.КонтролерСТК0));
		сткШапка.вставить("КонтролерСТКРП",глСервер.ПросклонятьРП(сткШапка.КонтролерСТК));
		сткШапка.вставить("длжКонтролерСТКРП",глСервер.ПросклонятьРП(Стр.длжКонтролерСТК));
		
		сткШапка.вставить("Ответственный",СПравочники.ФизическиеЛица.ФИОстр(Стр.Ответственный));
		
		сткШапка.вставить("каФИО",СПравочники.ФизическиеЛица.ФИОстр(Стр.каФИО0));
		сткШапка.вставить("каФИОРП",глСервер.ПросклонятьРП(сткШапка.каФИО));
		сткШапка.вставить("каДлжРП",глСервер.ПросклонятьРП(Стр.каДлж));
		
		Если  СокрЛП(сткШАпка.каФИОРП)="" Тогда  сткШАпка.каФИОРП = "_________________________________"; КонецЕСлИ;
		Если  СокрЛП(сткШАпка.каДлжРП)="" Тогда  сткШАпка.каДлжРП = "_________________________________"; КонецЕСлИ;
		
		прервать;
	КонецЦикла;
	
	//Формат дат
	если    МасКол.НАйти(НРЕГ("ДатаПриход"))  <>Неопределено
		или МасКол.НАйти(НРЕГ("ДатаОтгрузка"))<>Неопределено 
		или МасКол.НАйти(НРЕГ("ДатаЗаказа"))<>Неопределено 
		Тогда
		Тбл.Колонки.Добавить("ДатаПриход");
		Тбл.Колонки.Добавить("ДатаОтгрузка");
		Тбл.Колонки.Добавить("ДатаЗаказа");
		Для каждого Стр из Тбл Цикл
			Стр.ДатаПриход  =Формат(Стр.ДатаПрх,"ДФ=dd.MM.yyyy");
			Стр.ДатаОтгрузка=Формат(Стр.ДатаОтг,"ДФ=dd.MM.yyyy");
			Стр.ДатаЗаказа  =Формат(Стр.ДатаЗаказа0,"ДФ=dd.MM.yyyy");
		КонецЦикла;
	КонецЕсли;
	
	стрСвр = "";
	ДЛя каждого Кол из Тбл.Колонки Цикл
		
		Если МасКол.НАйти(НРЕГ(Кол.Имя))=Неопределено 
			или Найти(НРЕГ(Кол.Имя),"количество")<>0 
			или НРЕГ(Кол.Имя)="сумма" 
		Тогда Продолжить; КонецЕСЛИ;
		
		стрСвр = СтрСвр +","+Кол.Имя;
	КонецЦикла;
	
	Тбл.свернуть(Сред(Стрсвр,2),"Количество,КоличествоМеталлолом,Сумма");
	
	сткШапка.Вставить("итКол",Тбл.Итог("Количество"));
	сткШапка.Вставить("итМеталлолом",Тбл.Итог("КоличествоМеталлолом"));
	
	Возврат Тбл;
	
	
КонецФункции

Функция ЗаполнитьСткШапкаСдалПринял(сткШапка,ЭтоПриход)
	Если ЭтоПриход ТОгда 
		сткШапка.вставить("Получатель",сткШапка.Организация);
		сткШапка.вставить("Отправитель",сткШапка.Контрагент);
		сткШапка.вставить("ИсполнительСдалПринял","принял");
		сткШапка.вставить("ЗаказчикСдалПринял","сдал");
		сткШапка.вставить("СдалПринял","на капитальный ремонт");
	ИНаче
		сткШапка.вставить("Получатель",сткШапка.Контрагент);
		сткШапка.вставить("Отправитель",сткШапка.Организация);
		сткШапка.вставить("ИсполнительСдалПринял","сдал");
		сткШапка.вставить("ЗаказчикСдалПринял","принял");
		сткШапка.вставить("СдалПринял","из капитального ремонта");
	КонецЕсли;
КонецФункции

Функция ПолучитьМассивПараметров(Таб) экспорт
	
	Мас = Новый Массив;
	ДЛя а=1 по Таб.ВысотаТаблицы Цикл
		Для б=1 по Таб.ШиринаТаблицы Цикл
			Обл = Таб.Область(а,б,а,б);
			ЕСли Обл.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Параметр Тогда
				Мас.добавить(НРЕГ(Обл.Параметр));
				Если СокрЛП(Обл.ПараметрРасшифровки)<>"" Тогда
					Мас.добавить(НРЕГ(Обл.ПараметрРасшифровки));
				КонецЕсли;
			ИНАчеЕсли Обл.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Шаблон Тогда
				пСтр = СтрЗаменить(" "+Обл.Текст,"[",Символы.ПС);
				пСтр = СтрЗаменить(пСтр,"]",Символы.ПС);
				Для i=2 по СтрЧислоСтрок(пСтр) Цикл
					Мас.добавить(НРЕГ(СокрЛП(СтрПолучитьСтроку(пСтр,i))));
					i=i+1;
				КонецЦикла;
			КонецЕСлИ;
		Конеццикла;
	Конеццикла;
	
	
	Возврат Мас;
	
КонецФункции

Функция ПечатьНакладная(Мас,Макет,ссПечФормы=Неопределено,ДопСткШАпка=Неопределено) Экспорт
	
	Если Макет=Неопределено Тогда
		Макет=Справочники.ПечатныеФормы.ПолучитьМакет("Макет");	
	КонецеСЛИ;
	
	СткШапка=Новый Структура();
	МасИтераций = Новый Массив;
	МасИтераций.Добавить(ТипЗнч(Мас) = Тип("ДокументСсылка.ро_ПриходОборудования"));
	
	МасКол = ПолучитьМассивПараметров(Макет);
	Если маскол.Найти(НРЕГ("НомерОборудования0")) <> Неопределено Тогда
		МасКол.Добавить(НРЕГ("ЗаказНарядСсылка"));
	КонецЕсли;
	имяКолГрп="индГрп";
	Если ссПечФормы<>Неопределено Тогда
		Если СокрлП(ссПечФормы.ПолеГруппировки)<>"" Тогда
			 имяКолГрп = СокрлП(ссПечФормы.ПолеГруппировки);
		 КонецеСЛИ;
		 
		 Если  ТипЗнч(Мас) = Тип("ДокументСсылка.ро_Реестры") и ссПечФормы.Родитель=Справочники.ПечатныеФормы.СдачиПриемки Тогда
			 МасИтераций.Добавить(истина);
		 КонецЕсли;
	КонецЕсли;
	МасКол.Добавить(НРЕГ(имяКолГрп));
	
	ТБл = ДанныеДляПечати(Мас,МасКол,СткШапка,ссПечФормы);
	
	Если ДопСткШАпка<>Неопределено Тогда
		Для каждого Эл из ДопСткШапка Цикл
			СткШапка.Вставить(Эл.Ключ,Эл.Значение);
		КонецЦикла;
	КонецЕСЛИ;
	
	
	Таб = Новый ТабличныйДокумент;
	Таб.КлючПараметровПечати = "роПечатьНакладная";
	Если Тбл.Количество()=0 ТОгда Возврат Таб; КонецЕсли;
	
	Тбл.Колонки.Добавить("индГрп");
	
	грпТ = Тбл.Скопировать(,имяКолГрп+",Количество,КоличествоМеталлолом,Сумма");
	грпТ.свернуть(имяКолГрп,"Количество,КоличествоМеталлолом,Сумма");
//	грпТ.сортировать(имяКолГрп);

Для каждого ЭтоПриход из МасИтераций Цикл
	
	ЗаполнитьСткШапкаСдалПринял(сткШапка,ЭтоПриход);
	
	Для каждого стрТ из грпТ Цикл
		масТбл = ТБл.НайтиСтроки(Новый Структура(имяКолГрп,стрТ[имяКолГрп]));
		
		Обл = Макет.ПолучитьОбласть("Шапка");
		Обл.Параметры.Заполнить(СткШапка);
		Обл.Параметры.Заполнить(масТбл[0]);
		Таб.Вывести(Обл);
		
		
		Обл = Макет.ПолучитьОбласть("Строка");
		
		СткНом = Новый Структура("ном",0);
		
		Для каждого Стр из масТбл Цикл
			сткНом.ном=сткНом.Ном+1;
			Обл.Параметры.Заполнить(Стр);
			Обл.Параметры.Заполнить(СткНом);
			Таб.Вывести(Обл);
		КонецЦикла;
		
		Обл = Макет.ПолучитьОбласть("Подвал");
		
		Обл.Параметры.Заполнить(Тбл[0]);
		Обл.Параметры.Заполнить(стрТ);
		Обл.Параметры.Заполнить(СткШапка);
		
		Таб.Вывести(Обл);
		
		Таб.ВывестиГоризонтальныйРазделительСтраниц();
		
	КонецЦикла;
	
КонецЦикла;

	
	Таб.ТолькоПросмотр = Истина;
	Таб.АвтоМасштаб= Истина;
	Таб.ОтображатьГруппировки = Ложь;
	Таб.ОтображатьЗаголовки = Ложь;
	Таб.ОтображатьСетку = Ложь;
	
	Возврат Таб;
	
	
	
	
КонецФункции

#КонецОбласти
